# -*- coding: utf-8 -*-
# -----------------------------------------------------
# @Time    : 19-9-9 下午5:08
# @Author  : Ziping
# @Email   : zipingx.lv@intel.com
# -----------------------------------------------------


class MovieService(object):
    movie_cate = ['剧情', '动作', '爱情', '悬疑', '恐怖', '犯罪', '惊悚', '战争', '喜剧', '科幻', '动画', '纪录片', '历史',
                  '情色', '其他']

    movie_country = ['内地', '香港', '台湾', '美国', '日本', '韩国', '欧洲', '英国', '德国', '法国', '泰国', '印度', '意大利',
                     '瑞典', '其他']

    movie_time = ['2019', '2018', '2017', '2016', '2015', '2014', '2013', '2012', '2011', '2010', '2009', '2008',
                  '2007', '2006', '2005', '2004', '2003', '2002', '2001', '2000']

movie_service = MovieService()
